pressure-test/results/wrk2/smoke-20260504T070642Z.txt
D:/Git/scripts/plan_list_run.lua: cannot open D:/Git/scripts/plan_list_run.lua: No such file or directory
D:/Git/scripts/plan_list_run.lua: cannot open D:/Git/scripts/plan_list_run.lua: No such file or directory
D:/Git/scripts/plan_list_run.lua: cannot open D:/Git/scripts/plan_list_run.lua: No such file or directory
Running 30s test @ http://host.docker.internal:20004
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.690ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.749ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64s     3.28s   11.27s    82.72%
    Req/Sec    70.14    172.83     3.00k    96.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.47ms
 75.000%   23.20ms
 90.000%    8.10s 
 99.000%   10.97s 
 99.900%   11.26s 
 99.990%   11.28s 
 99.999%   11.28s 
100.000%   11.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.766     0.000000            1         1.00
       1.734     0.100000          270         1.11
       2.113     0.200000          541         1.25
       2.469     0.300000          810         1.43
       2.817     0.400000         1079         1.67
       3.475     0.500000         1350         2.00
       4.251     0.550000         1484         2.22
       5.791     0.600000         1619         2.50
       8.279     0.650000         1754         2.86
      12.911     0.700000         1888         3.33
      23.199     0.750000         2023         4.00
    1366.015     0.775000         2091         4.44
    3112.959     0.800000         2158         5.00
    4784.127     0.825000         2226         5.71
    6397.951     0.850000         2293         6.67
    7278.591     0.875000         2360         8.00
    7708.671     0.887500         2394         8.89
    8110.079     0.900000         2429        10.00
    8486.911     0.912500         2462        11.43
    8880.127     0.925000         2495        13.33
    9281.535     0.937500         2529        16.00
    9510.911     0.943750         2546        17.78
    9707.519     0.950000         2564        20.00
    9895.935     0.956250         2580        22.86
   10092.543     0.962500         2597        26.67
   10256.383     0.968750         2613        32.00
   10387.455     0.971875         2623        35.56
   10485.759     0.975000         2631        40.00
   10584.063     0.978125         2639        45.71
   10682.367     0.981250         2647        53.33
   10780.671     0.984375         2655        64.00
   10838.015     0.985938         2661        71.11
   10887.167     0.987500         2665        80.00
   10936.319     0.989062         2669        91.43
   10985.471     0.990625         2673       106.67
   11034.623     0.992188         2677       128.00
   11067.391     0.992969         2679       142.22
   11083.775     0.993750         2681       160.00
   11116.543     0.994531         2683       182.86
   11132.927     0.995313         2685       213.33
   11165.695     0.996094         2687       256.00
   11173.887     0.996484         2688       284.44
   11182.079     0.996875         2689       320.00
   11214.847     0.997266         2691       365.71
   11214.847     0.997656         2691       426.67
   11223.039     0.998047         2692       512.00
   11231.231     0.998242         2693       568.89
   11231.231     0.998437         2693       640.00
   11263.999     0.998633         2695       731.43
   11263.999     0.998828         2695       853.33
   11263.999     0.999023         2695      1024.00
   11263.999     0.999121         2695      1137.78
   11263.999     0.999219         2695      1280.00
   11272.191     0.999316         2696      1462.86
   11272.191     0.999414         2696      1706.67
   11272.191     0.999512         2696      2048.00
   11272.191     0.999561         2696      2275.56
   11272.191     0.999609         2696      2560.00
   11280.383     0.999658         2697      2925.71
   11280.383     1.000000         2697          inf
#[Mean    =     1638.732, StdDeviation   =     3280.647]
#[Max     =    11272.192, Total count    =         2697]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4702 requests in 30.00s, 2.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 38
  Non-2xx or 3xx responses: 4702
Requests/sec:    156.72
Transfer/sec:     86.81KB