pressure-test/results/wrk2/smoke-20260504T070906Z.txt
//scripts/plan_list_run.lua: cannot open //scripts/plan_list_run.lua: No such file or directory
//scripts/plan_list_run.lua: cannot open //scripts/plan_list_run.lua: No such file or directory
Running 30s test @ http://host.docker.internal:20004
//scripts/plan_list_run.lua: cannot open //scripts/plan_list_run.lua: No such file or directory
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.226ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.116ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.13ms    2.41ms  30.98ms   91.30%
    Req/Sec   105.26    102.28   555.00     40.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.47ms
 75.000%    3.23ms
 90.000%    5.19ms
 99.000%   13.53ms
 99.900%   26.30ms
 99.990%   30.99ms
 99.999%   30.99ms
100.000%   30.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.759     0.000000            1         1.00
       1.594     0.100000          401         1.11
       1.856     0.200000          798         1.25
       2.075     0.300000         1199         1.43
       2.281     0.400000         1600         1.67
       2.473     0.500000         1997         2.00
       2.577     0.550000         2195         2.22
       2.723     0.600000         2398         2.50
       2.863     0.650000         2594         2.86
       3.021     0.700000         2794         3.33
       3.235     0.750000         2993         4.00
       3.407     0.775000         3093         4.44
       3.579     0.800000         3192         5.00
       3.841     0.825000         3294         5.71
       4.183     0.850000         3392         6.67
       4.631     0.875000         3494         8.00
       4.907     0.887500         3543         8.89
       5.187     0.900000         3591        10.00
       5.539     0.912500         3642        11.43
       5.887     0.925000         3691        13.33
       6.631     0.937500         3741        16.00
       6.895     0.943750         3766        17.78
       7.211     0.950000         3791        20.00
       8.043     0.956250         3816        22.86
       8.711     0.962500         3842        26.67
       9.335     0.968750         3866        32.00
       9.623     0.971875         3878        35.56
       9.959     0.975000         3891        40.00
      10.391     0.978125         3903        45.71
      10.943     0.981250         3916        53.33
      11.575     0.984375         3928        64.00
      11.951     0.985938         3934        71.11
      12.335     0.987500         3941        80.00
      12.631     0.989062         3947        91.43
      13.727     0.990625         3953       106.67
      14.311     0.992188         3959       128.00
      15.335     0.992969         3962       142.22
      15.935     0.993750         3966       160.00
      16.143     0.994531         3969       182.86
      16.959     0.995313         3972       213.33
      19.455     0.996094         3975       256.00
      19.679     0.996484         3976       284.44
      20.143     0.996875         3978       320.00
      21.007     0.997266         3980       365.71
      21.183     0.997656         3981       426.67
      21.807     0.998047         3983       512.00
      21.807     0.998242         3983       568.89
      22.831     0.998437         3984       640.00
      25.039     0.998633         3985       731.43
      26.303     0.998828         3986       853.33
      26.767     0.999023         3987      1024.00
      26.767     0.999121         3987      1137.78
      26.767     0.999219         3987      1280.00
      27.919     0.999316         3988      1462.86
      27.919     0.999414         3988      1706.67
      30.671     0.999512         3989      2048.00
      30.671     0.999561         3989      2275.56
      30.671     0.999609         3989      2560.00
      30.671     0.999658         3989      2925.71
      30.671     0.999707         3989      3413.33
      30.991     0.999756         3990      4096.00
      30.991     1.000000         3990          inf
#[Mean    =        3.133, StdDeviation   =        2.414]
#[Max     =       30.976, Total count    =         3990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 3.25MB read
  Non-2xx or 3xx responses: 6002
Requests/sec:    200.05
Transfer/sec:    110.80KB