pressure-test/results/wrk2/smoke-20260504T071020Z.txt
Running 30s test @ http://host.docker.internal:20004
  2 threads and 10 connections
  Thread calibration: mean lat.: 3916.488ms, rate sampling interval: 15843ms
  Thread calibration: mean lat.: 4349.679ms, rate sampling interval: 17039ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.59s     5.72s   27.98s    56.76%
    Req/Sec     6.00      0.00     6.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.07s 
 75.000%   23.28s 
 90.000%   26.98s 
 99.000%   27.80s 
 99.900%   28.00s 
 99.990%   28.00s 
 99.999%   28.00s 
100.000%   28.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9043.967     0.000000            1         1.00
   11419.647     0.100000           26         1.11
   11984.895     0.200000           52         1.25
   14671.871     0.300000           78         1.43
   15998.975     0.400000          104         1.67
   19070.975     0.500000          131         2.00
   19529.727     0.550000          143         2.22
   20152.319     0.600000          156         2.50
   22020.095     0.650000          169         2.86
   22937.599     0.700000          182         3.33
   23298.047     0.750000          195         4.00
   23560.191     0.775000          201         4.44
   24363.007     0.800000          208         5.00
   25133.055     0.825000          214         5.71
   26263.551     0.850000          221         6.67
   26804.223     0.875000          227         8.00
   26853.375     0.887500          230         8.89
   27000.831     0.900000          234        10.00
   27148.287     0.912500          237        11.43
   27213.823     0.925000          240        13.33
   27262.975     0.937500          243        16.00
   27312.127     0.943750          245        17.78
   27344.895     0.950000          247        20.00
   27361.279     0.956250          248        22.86
   27410.431     0.962500          250        26.67
   27443.199     0.968750          251        32.00
   27492.351     0.971875          252        35.56
   27508.735     0.975000          253        40.00
   27525.119     0.978125          254        45.71
   27738.111     0.981250          255        53.33
   27738.111     0.984375          255        64.00
   27803.647     0.985938          256        71.11
   27803.647     0.987500          256        80.00
   27852.799     0.989062          257        91.43
   27852.799     0.990625          257       106.67
   27852.799     0.992188          257       128.00
   27901.951     0.992969          258       142.22
   27901.951     0.993750          258       160.00
   27901.951     0.994531          258       182.86
   27901.951     0.995313          258       213.33
   27901.951     0.996094          258       256.00
   28000.255     0.996484          259       284.44
   28000.255     1.000000          259          inf
#[Mean    =    18588.739, StdDeviation   =     5717.314]
#[Max     =    27983.872, Total count    =          259]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  396 requests in 30.03s, 81.33MB read
  Socket errors: connect 0, read 0, write 0, timeout 55
Requests/sec:     13.19
Transfer/sec:      2.71MB

Requests/sec: 13.19
p50 latency: 19070.97ms
p95 latency: 27328.51ms
p99 latency: 27803.65ms
max latency: 27983.87ms